backend/views/inf-for-teacher/index.php

            'id',
            [
                'attribute' => 'user_id',
                'filter' => \backend\models\UserName::find()->select(["CONCAT(lastname, ' ', firstname)", 'id'])->where(['status' => 1])->indexBy('id')->column(),
---
SELECT CONCAT(lastname, ' ', firstname), `id` FROM `user_name` WHERE `status`=1


            ['attribute' => 'group_id','label' => 'Группа', 'value'=>'group.name'],
            ['attribute' => 'subject_id','label' => 'Дисциплина', 'value'=>'subject.name',
                'filter' => \backend\models\Subject::find()->select(["name", 'id'])->indexBy('id')->column(),
                ],
            ['attribute' => 'type_id','label' => 'Тип дисциплины', 'value'=>'type.name',
                'filter' => \backend\models\Type::find()->select(["name", 'id'])->indexBy('id')->column(),
---
SELECT `name`, `id` FROM `subject`
SELECT `name`, `id` FROM `type`