frontend/controllers/SiteController.php

SELECT * FROM `groups` WHERE `id`=1
---
    public function actionIndexStudent(){
        if (Yii::$app->user->isGuest) {
            return $this->actionLogin();
        }
        $search = ['student_id' => $this->getUserID()];
        $n = mb_substr(Yii::$app->user->identity->userName[0]->group->name, 3,1);

SELECT * FROM `subject` WHERE `id` IN ('1', '2')
SELECT * FROM `type` WHERE `id` IN ('1', '2')
---
            }


        $model = Rating::find()
            ->with(['teacher', 'type', 'subject'])
            ->where($search)
            ->andWhere($arr)
            ->asArray()->all();