backend/views/rating/_form.php

SELECT CONCAT(lastname, ' ', firstname), `id` FROM `user_name` WHERE `status`=1
SELECT `name`, `id` FROM `subject`
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'teacher_id')->dropDownList(\backend\models\UserName::find()->select(["CONCAT(lastname, ' ', firstname)", 'id'])->where(['status' => 1])->indexBy('id')->column(), ['prompt' => 'Выбрать преподавателя...']) ?>

    <?= $form->field($model, 'subject_id')->dropDownList(\backend\models\Subject::find()->select(["name", 'id'])->indexBy('id')->column(), ['prompt' => 'Выбрать дисциплину...']) ?>

SELECT `name`, `id` FROM `type`
SELECT CONCAT(lastname, ' ', firstname), `id` FROM `user_name` WHERE `status` != 1
---

    <?= $form->field($model, 'date')->textInput() ?>

    <?= $form->field($model, 'type_id')->dropDownList(\backend\models\Type::find()->select(["name", 'id'])->indexBy('id')->column(), ['prompt' => 'Выбрать тип дисциплины...']) ?>

    <?= $form->field($model, 'student_id')->dropDownList(\backend\models\UserName::find()->select(["CONCAT(lastname, ' ', firstname)", 'id'])->where(['!=','status' , 1])->indexBy('id')->column(), ['prompt' => 'Выбрать студента...']) ?>