frontend/views/site/index-student.php

SELECT * FROM `groups` WHERE `id`=1
---

    <h4><b>Студент: </b><?= Yii::$app->user->identity->userName[0]->fio; ?></h4>

    <h4><b>Группа: </b><?= Yii::$app->user->identity->userName[0]->group->name ?></h4>